Autodesk.Revit.DB.FabricationRodInfo.AttachToHanger(Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ)
Attaches the hanger rod to another bearer hanger.
hangerId:
Id of the bearer hanger to which the rod attaches.
rodIndex:
The index of the rod.
position:
The position of the rod end. It should be on bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The hanger is not a bearer hanger.
-or-
the point is not on hanger bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2017